README.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Robot Club</a>
<ul>
<li><a href="#sec-1-1">1.1. Robot</a></li>
</ul>
</li>
<li><a href="#sec-2">2. <span class="todo TODO">TODO</span> Instructions to follow</a></li>
</ul>
</div>
</div>



# Robot Club<a id="sec-1" name="sec-1"></a>

This is code to assist in learning:
-   how to code,
-   robotic concepts, and
-   source control

**NOTE** Branches are important, as not all functionality has been merged back into master.

## Robot<a id="sec-1-1" name="sec-1-1"></a>

Arduino source for MakeBlock mBot/mCore:
-   <http://www.makeblock.com/mbot-v1-1-stem-educational-robot-kit>
-   <http://www.makeblock.com/mcore-main-control-board-for-mbot>

The code is enough to highlight some features of the robot.
Code derived from, and in some cases a subset of <https://github.com/Makeblock-official/mBot>

# TODO Instructions to follow<a id="sec-2" name="sec-2"></a>